Revit 2027 API
ChangeType.ConcatenateChangeTypes Method
 Creates a ChangeType that is a union of the two input ChangeTypes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ChangeType ConcatenateChangeTypes(
	ChangeType changeType1,
	ChangeType changeType2
)
Public Shared Function ConcatenateChangeTypes (
	changeType1 As ChangeType,
	changeType2 As ChangeType
) As ChangeType
public:
static ChangeType^ ConcatenateChangeTypes(
	ChangeType^ changeType1,
	ChangeType^ changeType2
)
static member ConcatenateChangeTypes :
        changeType1 : ChangeType *
        changeType2 : ChangeType -> ChangeType
Parameters
changeType1 ChangeType
 First input ChangeType to be concatenated
changeType2 ChangeType
 Second input ChangeType to be concatenated
Return Value
ChangeType
 A new ChangeType that is a concatenation/union of the input change types
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ChangeType Class
Autodesk.Revit.DB Namespace